## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_alb.back-lb will be destroyed
  # (because aws_alb.back-lb is not in configuration)
  - resource "aws_alb" "back-lb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44" -> null
      - arn_suffix                                  = "app/stagnum-back-lb/577bc846e7a42d44" -> null
      - client_keep_alive                           = 3600 -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "stagnum-back-lb-1793228185.eu-north-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "stagnum-back-lb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-0933e7f0a352c9ba0",
        ] -> null
      - subnets                                     = [
          - "subnet-08d9148bb2f8ed7f7",
          - "subnet-08fd7c14ba8a07d92",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-059787243b0515c01" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z23TAZ6LKFMNIO" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-08d9148bb2f8ed7f7" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-08fd7c14ba8a07d92" -> null
        }
    }

  # aws_alb.front-lb will be destroyed
  # (because aws_alb.front-lb is not in configuration)
  - resource "aws_alb" "front-lb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c" -> null
      - arn_suffix                                  = "app/stagnum-front-lb/ab563dd56f0d527c" -> null
      - client_keep_alive                           = 3600 -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "stagnum-front-lb-281869962.eu-north-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "stagnum-front-lb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-0933e7f0a352c9ba0",
        ] -> null
      - subnets                                     = [
          - "subnet-08d9148bb2f8ed7f7",
          - "subnet-08fd7c14ba8a07d92",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-059787243b0515c01" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z23TAZ6LKFMNIO" -> null

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-08d9148bb2f8ed7f7" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-08fd7c14ba8a07d92" -> null
        }
    }

  # aws_cloudwatch_log_group.log-group will be destroyed
  # (because aws_cloudwatch_log_group.log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "log-group" {
      - arn               = "arn:aws:logs:eu-north-1:851725292587:log-group:stagnum-logs" -> null
      - id                = "stagnum-logs" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "stagnum-logs" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_default_subnet.default_subnet_a will be destroyed
  # (because aws_default_subnet.default_subnet_a is not in configuration)
  - resource "aws_default_subnet" "default_subnet_a" {
      - arn                                            = "arn:aws:ec2:eu-north-1:851725292587:subnet/subnet-08fd7c14ba8a07d92" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-north-1a" -> null
      - availability_zone_id                           = "eun1-az1" -> null
      - cidr_block                                     = "172.31.16.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - existing_default_subnet                        = true -> null
      - force_destroy                                  = false -> null
      - id                                             = "subnet-08fd7c14ba8a07d92" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "851725292587" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-059787243b0515c01" -> null
    }

  # aws_default_subnet.default_subnet_b will be destroyed
  # (because aws_default_subnet.default_subnet_b is not in configuration)
  - resource "aws_default_subnet" "default_subnet_b" {
      - arn                                            = "arn:aws:ec2:eu-north-1:851725292587:subnet/subnet-08d9148bb2f8ed7f7" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-north-1b" -> null
      - availability_zone_id                           = "eun1-az2" -> null
      - cidr_block                                     = "172.31.32.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - existing_default_subnet                        = true -> null
      - force_destroy                                  = false -> null
      - id                                             = "subnet-08d9148bb2f8ed7f7" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "851725292587" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-059787243b0515c01" -> null
    }

  # aws_default_vpc.default_vpc will be destroyed
  # (because aws_default_vpc.default_vpc is not in configuration)
  - resource "aws_default_vpc" "default_vpc" {
      - arn                                  = "arn:aws:ec2:eu-north-1:851725292587:vpc/vpc-059787243b0515c01" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "172.31.0.0/16" -> null
      - default_network_acl_id               = "acl-0499aa6533bd5de23" -> null
      - default_route_table_id               = "rtb-0e8924ceb8507f7c2" -> null
      - default_security_group_id            = "sg-0532aa978471f603e" -> null
      - dhcp_options_id                      = "dopt-0fff3f822a06bca4c" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - existing_default_vpc                 = true -> null
      - force_destroy                        = false -> null
      - id                                   = "vpc-059787243b0515c01" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0e8924ceb8507f7c2" -> null
      - owner_id                             = "851725292587" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
    }

  # aws_ebs_volume.posrgres will be created
  + resource "aws_ebs_volume" "posrgres" {
      + arn               = (known after apply)
      + availability_zone = "eu-north-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + throughput        = (known after apply)
      + type              = (known after apply)
    }

  # aws_ecs_cluster.aws-cluster will be destroyed
  # (because aws_ecs_cluster.aws-cluster is not in configuration)
  - resource "aws_ecs_cluster" "aws-cluster" {
      - arn      = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" -> null
      - id       = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" -> null
      - name     = "stagnum-cluster" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - configuration {
          - execute_command_configuration {
              - kms_key_id = "arn:aws:kms:eu-north-1:851725292587:key/60118a5f-9f2f-4ef1-a690-31b80762a8a9" -> null
              - logging    = "OVERRIDE" -> null

              - log_configuration {
                  - cloud_watch_encryption_enabled = true -> null
                  - cloud_watch_log_group_name     = "stagnum-logs" -> null
                  - s3_bucket_encryption_enabled   = false -> null
                }
            }
        }
    }

  # aws_ecs_service.stagnum-back-service will be destroyed
  # (because aws_ecs_service.stagnum-back-service is not in configuration)
  - resource "aws_ecs_service" "stagnum-back-service" {
      - cluster                            = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:eu-north-1:851725292587:service/stagnum-cluster/stagnum-back-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "stagnum-back-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-back-task:2" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "stagnum-back-container" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-0a133d706c3dfec36",
            ] -> null
          - subnets          = [
              - "subnet-08d9148bb2f8ed7f7",
              - "subnet-08fd7c14ba8a07d92",
            ] -> null
        }
    }

  # aws_ecs_service.stagnum-front-service will be destroyed
  # (because aws_ecs_service.stagnum-front-service is not in configuration)
  - resource "aws_ecs_service" "stagnum-front-service" {
      - cluster                            = "arn:aws:ecs:eu-north-1:851725292587:cluster/stagnum-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:eu-north-1:851725292587:service/stagnum-cluster/stagnum-front-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "stagnum-front-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-front-task:2" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "stagnum-front-container" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-0a133d706c3dfec36",
            ] -> null
          - subnets          = [
              - "subnet-08d9148bb2f8ed7f7",
              - "subnet-08fd7c14ba8a07d92",
            ] -> null
        }
    }

  # aws_ecs_task_definition.back-task will be destroyed
  # (because aws_ecs_task_definition.back-task is not in configuration)
  - resource "aws_ecs_task_definition" "back-task" {
      - arn                      = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-back-task:2" -> null
      - arn_without_revision     = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-back-task" -> null
      - container_definitions    = (sensitive value) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::851725292587:role/ecsTaskExecutionRole" -> null
      - family                   = "stagnum-back-task" -> null
      - id                       = "stagnum-back-task" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 2 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - track_latest             = false -> null
    }

  # aws_ecs_task_definition.front-task will be destroyed
  # (because aws_ecs_task_definition.front-task is not in configuration)
  - resource "aws_ecs_task_definition" "front-task" {
      - arn                      = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-front-task:2" -> null
      - arn_without_revision     = "arn:aws:ecs:eu-north-1:851725292587:task-definition/stagnum-front-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "NEXT_PUBLIC_BACKEND_URI"
                          - value = "http://stagnum-back-lb-1793228185.eu-north-1.elb.amazonaws.com"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_FRONTEND_URI"
                          - value = "http://stagnum-front-lb-281869962.eu-north-1.elb.amazonaws.com"
                        },
                    ]
                  - essential        = true
                  - image            = "eddiethecubehead/stagnum_client:master"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "stagnum-logs"
                          - awslogs-region        = "eu-north-1"
                          - awslogs-stream-prefix = "stagnum"
                        }
                    }
                  - mountPoints      = []
                  - name             = "stagnum-front-container"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::851725292587:role/ecsTaskExecutionRole" -> null
      - family                   = "stagnum-front-task" -> null
      - id                       = "stagnum-front-task" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 2 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - track_latest             = false -> null
    }

  # aws_iam_role.ecsTaskExecutionRole will be destroyed
  # (because aws_iam_role.ecsTaskExecutionRole is not in configuration)
  - resource "aws_iam_role" "ecsTaskExecutionRole" {
      - arn                   = "arn:aws:iam::851725292587:role/ecsTaskExecutionRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-15T21:02:58Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecsTaskExecutionRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecsTaskExecutionRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA4MTWISQVRIRBGEL72" -> null
    }

  # aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
      - id         = "ecsTaskExecutionRole-20240415210258547000000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "ecsTaskExecutionRole" -> null
    }

  # aws_kms_key.stagnum will be destroyed
  # (because aws_kms_key.stagnum is not in configuration)
  - resource "aws_kms_key" "stagnum" {
      - arn                                = "arn:aws:kms:eu-north-1:851725292587:key/60118a5f-9f2f-4ef1-a690-31b80762a8a9" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days            = 7 -> null
      - description                        = "stagnum" -> null
      - enable_key_rotation                = false -> null
      - id                                 = "60118a5f-9f2f-4ef1-a690-31b80762a8a9" -> null
      - is_enabled                         = true -> null
      - key_id                             = "60118a5f-9f2f-4ef1-a690-31b80762a8a9" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::851725292587:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days            = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
    }

  # aws_lb_listener.client-listener will be destroyed
  # (because aws_lb_listener.client-listener is not in configuration)
  - resource "aws_lb_listener" "client-listener" {
      - arn               = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-front-lb/ab563dd56f0d527c/247e82bce58ead86" -> null
      - id                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-front-lb/ab563dd56f0d527c/247e82bce58ead86" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_listener.server-listener will be destroyed
  # (because aws_lb_listener.server-listener is not in configuration)
  - resource "aws_lb_listener" "server-listener" {
      - arn               = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-back-lb/577bc846e7a42d44/a51e31248fc69ded" -> null
      - id                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:listener/app/stagnum-back-lb/577bc846e7a42d44/a51e31248fc69ded" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_target_group.back-target-group will be destroyed
  # (because aws_lb_target_group.back-target-group is not in configuration)
  - resource "aws_lb_target_group" "back-target-group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" -> null
      - arn_suffix                         = "targetgroup/back-target-group/4617b821fdf233cd" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/back-target-group/4617b821fdf233cd" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-back-lb/577bc846e7a42d44",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "back-target-group" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-059787243b0515c01" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 60 -> null
          - matcher             = "200-399" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 5 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}
    }

  # aws_lb_target_group.front-target-group will be destroyed
  # (because aws_lb_target_group.front-target-group is not in configuration)
  - resource "aws_lb_target_group" "front-target-group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" -> null
      - arn_suffix                         = "targetgroup/front-target-group/65aeaa00a8d33a5e" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-north-1:851725292587:targetgroup/front-target-group/65aeaa00a8d33a5e" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-north-1:851725292587:loadbalancer/app/stagnum-front-lb/ab563dd56f0d527c",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "front-target-group" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-059787243b0515c01" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 60 -> null
          - matcher             = "200-399" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 10 -> null
          - unhealthy_threshold = 5 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}
    }

  # aws_security_group.aws-lb_security_group will be destroyed
  # (because aws_security_group.aws-lb_security_group is not in configuration)
  - resource "aws_security_group" "aws-lb_security_group" {
      - arn                    = "arn:aws:ec2:eu-north-1:851725292587:security-group/sg-0933e7f0a352c9ba0" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0933e7f0a352c9ba0" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "terraform-20240415210258116900000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "851725292587" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-059787243b0515c01" -> null
    }

  # aws_security_group.aws-service_security_group will be destroyed
  # (because aws_security_group.aws-service_security_group is not in configuration)
  - resource "aws_security_group" "aws-service_security_group" {
      - arn                    = "arn:aws:ec2:eu-north-1:851725292587:security-group/sg-0a133d706c3dfec36" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a133d706c3dfec36" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0933e7f0a352c9ba0",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "terraform-20240415210302135500000003" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "851725292587" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-059787243b0515c01" -> null
    }

  # aws_volume_attachment.this will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

  # module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0dc1ddd4917dcf47a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "eu-north-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "user1"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-stack"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-stack"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d0ba5302375285b89208b532da236426e43f0935"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "Stagnum-stack"
        }
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for stagnum"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "Stagnum-security-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-security-group"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-security-group"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security_group.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.ingress_rules[2] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All IPV4 ICMP"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-default"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-default"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-default"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-default"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-default"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-default"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-public"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-public"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-public-eu-north-1a"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc-public-eu-north-1a"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "Stagnum-vpc"
          + "Project"     = "Stagnum"
          + "Terraform"   = "true"
        }
    }

Plan: 17 to add, 0 to change, 20 to destroy.

Changes to Outputs:
  - back_lb_dns    = "stagnum-back-lb-1793228185.eu-north-1.elb.amazonaws.com" -> null
  + ec2_eip        = (known after apply)
  + ec2_public_dns = (known after apply)
  - front_lb_dns   = "stagnum-front-lb-281869962.eu-north-1.elb.amazonaws.com" -> null
```
</details>